zBlueBird/temperture/temprature-master-based-on-rtl8762c/src/ble/profile/server/dfu_service.c
#include <string.h>
#include <gatt.h>
#include <bt_types.h>
#include "trace.h"
#include "gap_le.h"
#include "gap_conn_le.h"
#include "gap_msg.h"
#include "app_msg.h"
#include "flash_device.h"
#include "rtl876x_wdg.h"
#include "ota_service.h"
#include "dfu_service.h"
#include "silent_dfu_flash.h"
#include "dfu_api.h"
#include "patch_header_check.h"
#include "board.h"
#include "flash_adv_cfg.h"
#include "os_sched.h"
#include "mem_config.h"
#include "otp.h"
#include "rtl876x_hw_aes.h"
#include "patch_header_check.h"
#include "os_sched.h"
#include "app_section.h"
#include "os_sync.h"
#include "platform_utils.h"
#include "hw_aes.h"

#if SUPPORT_SILENT_OTA
#define CAL_OFFSET(type, member) ((size_t)(&((type *)0)->member))

extern  uint8_t g_dfu_service_id;

uint8_t ota_temp_buffer_head[DFU_TEMP_BUFFER_SIZE];
uint8_t *p_ota_temp_buffer_head;
uint16_t g_ota_tmp_buf_used_size;
uint16_t mBufSize;
uint16_t mCrcVal;
T_DFU_CB g_dfu_para;
bool g_sil_buf_check_en = false;
uint32_t g_sil_dfu_resend_offset = 0;
P_FUN_SERVER_GENERAL_CB pfn_dfu_extended_cb = NULL;

P_FUN_DFU_OPCODE_CB dfu_service_handle_control_point_req_cb __attribute__((weak)) = NULL;


const uint8_t   SILENCE_GATT_UUID128_DFU_SERVICE[16] = {0x12, 0xA2, 0x4D, 0x2E, 0xFE, 0x14, 0x48, 0x8e, 0x93, 0xD2, 0x17, 0x3C, 0x87, 0x62, 0x00, 0x00};

T_ATTRIB_APPL silence_dfu_service[] =
{

    /*-------------------------- DFU Service ---------------------------*/
    /* <<Primary Service>>, .. */
    {
        (ATTRIB_FLAG_VOID | ATTRIB_FLAG_LE),           /* flags     */
        {
            LO_WORD(GATT_UUID_PRIMARY_SERVICE),
            HI_WORD(GATT_UUID_PRIMARY_SERVICE),              /* type_value */
        },
        UUID_128BIT_SIZE,                                    /* bValueLen     */
        (void *)SILENCE_GATT_UUID128_DFU_SERVICE,           /* p_value_context */
        GATT_PERM_READ                                      /* permissions  */
    },



    /* <<Characteristic>>, .. */
    {
        ATTRIB_FLAG_VALUE_INCL,                     /* flags */
        {                                           /* type_value */
            LO_WORD(GATT_UUID_CHARACTERISTIC),
            HI_WORD(GATT_UUID_CHARACTERISTIC),
            GATT_CHAR_PROP_WRITE_NO_RSP/* characteristic properties */
            /* characteristic UUID not needed here, is UUID of next attrib. */
        },
        1,                                          /* bValueLen */
        NULL,
        GATT_PERM_READ                              /* permissions */
    },
    /*--- DFU packet characteristic value ---*/
    {
        ATTRIB_FLAG_VALUE_APPL | ATTRIB_FLAG_UUID_128BIT,                              /* flags */
        {                                                           /* type_value */
            GATT_UUID128_DFU_PACKET
        },
        0,                                                 /* bValueLen */
        NULL,
#if DFU_SERVER_REQUIRE_AUTH
        GATT_PERM_WRITE_AUTHEN_MITM_REQ                             /* permissions */
#else
        GATT_PERM_WRITE           /* permissions */
#endif
    },
    /* <<Characteristic>>, .. */
    {
        ATTRIB_FLAG_VALUE_INCL,                     /* flags */
        {                                           /* type_value */
            LO_WORD(GATT_UUID_CHARACTERISTIC),
            HI_WORD(GATT_UUID_CHARACTERISTIC),
            (GATT_CHAR_PROP_WRITE |                   /* characteristic properties */
             GATT_CHAR_PROP_NOTIFY)
            /* characteristic UUID not needed here, is UUID of next attrib. */
        },
        1,                                          /* bValueLen */
        NULL,
        GATT_PERM_READ                              /* permissions */
    },
    /*--- DFU Control Point value ---*/
    {
        ATTRIB_FLAG_VALUE_APPL | ATTRIB_FLAG_UUID_128BIT,                              /* flags */
        {                                                           /* type_value */
            GATT_UUID128_DFU_CONTROL_POINT
        },
        0,                                                 /* bValueLen */
        NULL,
#if DFU_SERVER_REQUIRE_AUTH
        GATT_PERM_WRITE_AUTHEN_MITM_REQ                             /* permissions */
#else
        GATT_PERM_WRITE           /* permissions */
#endif
    },
    /* client characteristic configuration */
    {
        (ATTRIB_FLAG_VALUE_INCL |                   /* flags */
         ATTRIB_FLAG_CCCD_APPL),
        {                                           /* type_value */
            LO_WORD(GATT_UUID_CHAR_CLIENT_CONFIG),
            HI_WORD(GATT_UUID_CHAR_CLIENT_CONFIG),
            /* NOTE: this value has an instantiation for each client, a write to */
            /* this attribute does not modify this default value:                */
            LO_WORD(GATT_CLIENT_CHAR_CONFIG_DEFAULT), /* client char. config. bit field */
            HI_WORD(GATT_CLIENT_CHAR_CONFIG_DEFAULT)
        },
        2,                                          /* bValueLen */
        NULL,
#if DFU_SERVER_REQUIRE_AUTH
        (GATT_PERM_READ | GATT_PERM_WRITE_AUTHEN_MITM_REQ)          /* permissions */
#else
        (GATT_PERM_READ | GATT_PERM_WRITE)          /* permissions */
#endif
    }

};


/**
 * @brief silence_BufferCheckProc
 *
 * @param buffer_size     size for buffer check.
 * @param crc            calced buffer crc value.
 * @return None
*/
void silence_BufferCheckProc(uint8_t conn_id, uint16_t buffer_size, uint16_t crc)
{
    uint32_t signal;//os lock signal
    uint16_t offset = 0;
    uint8_t notif_data[DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC] = {0};
    notif_data[0] = DFU_OPCODE_NOTIFICATION;
    notif_data[1] = DFU_OPCODE_REPORT_BUFFER_CRC;

    if (mBufSize > DFU_TEMP_BUFFER_SIZE)
    {
        //invalid para
        g_ota_tmp_buf_used_size = 0;
        notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
        LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
        server_send_data(conn_id, g_dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
        return;
    }

    if (g_ota_tmp_buf_used_size == mBufSize ||
        g_dfu_para.cur_offset + g_ota_tmp_buf_used_size == g_dfu_para.image_total_length
       )
    {
        if (dfu_checkbufcrc(p_ota_temp_buffer_head, g_ota_tmp_buf_used_size, crc))     //crc error

        {
            g_ota_tmp_buf_used_size = 0;
            notif_data[2] = DFU_ARV_FAIL_CRC_ERROR;
            LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
            server_send_data(conn_id, g_dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                             notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
            return;
        }

        else //crc ok
        {
            if (OTP->ota_with_encryption_data)
            {
                //aes
                do
                {
                    if ((g_ota_tmp_buf_used_size - offset) >= 16)
                    {
#if defined ( __ICCARM__   )
#pragma diag_suppress=Pa039
#endif
                        hw_aes_init(OTP->aes_key, NULL, AES_MODE_ECB, OTP->ota_with_encryption_use_aes256);
#if defined ( __ICCARM__   )
#pragma diag_warning=Pa039
#endif
                        hw_aes_decrypt_16byte(p_ota_temp_buffer_head + offset, p_ota_temp_buffer_head + offset);
                        offset += 16;
                    }
                    else
                    {
                        break;
                    }
                }
                while (1);
            }
            unlock_flash_all();
            DFU_PRINT_TRACE1("g_dfu_para.cur_offset=%d", g_dfu_para.cur_offset);

            uint32_t result = sil_dfu_update(g_dfu_para.signature, g_dfu_para.cur_offset,
                                             g_ota_tmp_buf_used_size,
                                             (uint32_t *)p_ota_temp_buffer_head);

            if (result == 0)
            {
                g_dfu_para.cur_offset += g_ota_tmp_buf_used_size;

                if ((g_dfu_para.cur_offset - g_sil_dfu_resend_offset) >= FMC_SEC_SECTION_LEN)
                {
                    g_sil_dfu_resend_offset += FMC_SEC_SECTION_LEN;
                }
                g_ota_tmp_buf_used_size = 0;
                notif_data[2] = DFU_ARV_SUCCESS; //valid
                LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
                server_send_data(conn_id, g_dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
                lock_flash();
                return;
            }
            else
            {
                uint32_t ret = 0;
                uint32_t cnt = 0;
                do
                {
                    if (g_dfu_para.signature == SIGNATURE_APP_DEFINE)
                    {
                        flash_erase_locked(FLASH_ERASE_SECTOR, APP_DEFINE_DATA_ADDR + g_sil_dfu_resend_offset);
                        ret = dfu_flash_check_appdefine_blank(APP_DEFINE_DATA_ADDR, g_sil_dfu_resend_offset,
                                                              FMC_SEC_SECTION_LEN);
                    }
                    else
                    {
                        dfu_flash_erase(g_dfu_para.signature, g_sil_dfu_resend_offset);
                        signal = os_lock();
                        ret = dfu_flash_check_blank(g_dfu_para.signature, g_sil_dfu_resend_offset, FMC_SEC_SECTION_LEN);
                        os_unlock(signal);
                    }

                    if (ret)
                    {
                        cnt++;
                    }
                    else
                    {
                        break;
                    }
                    if (cnt >= 3)     //check 0xff failed,erase failed
                    {
                        //erase error
                        g_ota_tmp_buf_used_size = 0;
                        g_dfu_para.cur_offset =  g_sil_dfu_resend_offset;
                        notif_data[2] = DFU_ARV_FAIL_ERASE_ERROR;
                        LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
                        server_send_data(conn_id, g_dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                         notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
                        lock_flash();
                        return;
                    }
                }
                while (1);

