zBlueBird/temperture/temprature-master-based-on-rtl8762c/src/ble/profile/server/dfu_service.c
            /*check if start dfu fileds are vaild*/
#ifdef SDK_8772
            if (g_dfu_para.ic_type == 0x09)
#else
            if (g_dfu_para.ic_type == 0x05)
#endif
            {
                if (((g_dfu_para.signature >= OTA) && (g_dfu_para.signature < IMAGE_MAX))
                    || (g_dfu_para.signature == SIGNATURE_APP_DEFINE))
                {
                    unlock_flash_all();
                    if (sil_dfu_update(g_dfu_para.signature, 0, DFU_HEADER_SIZE, (uint32_t *)&g_dfu_para.ic_type) == 0)
                    {
                        lock_flash();
                        g_dfu_para.cur_offset += DFU_HEADER_SIZE;
                    }
                    else
                    {
                        lock_flash();
                        silent_dfu_reset(g_dfu_para.signature);
                        dfu_fw_active_reset();
                    }

                    PROFILE_PRINT_INFO0("dfu_act_notify_start_dfu");
                    notif_data[0] = DFU_OPCODE_NOTIFICATION;
                    notif_data[1] = DFU_OPCODE_START_DFU;
                    notif_data[2] = DFU_ARV_SUCCESS;

                    server_send_data(conn_id, g_dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                     notif_data, DFU_NOTIFY_LENGTH_ARV, GATT_PDU_TYPE_NOTIFICATION);

                }
                else
                {
                    DFU_PRINT_TRACE0("[DFU] err: start dfu signature is invalid.");
                    notif_data[0] = DFU_OPCODE_NOTIFICATION;
                    notif_data[1] = DFU_OPCODE_START_DFU;
                    notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
                    server_send_data(conn_id, g_dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                     notif_data, DFU_NOTIFY_LENGTH_ARV, GATT_PDU_TYPE_NOTIFICATION);
                    return;
                }
            }
            else
            {
                DFU_PRINT_TRACE0("[DFU] err: start dfu ic type is invalid.");
                notif_data[0] = DFU_OPCODE_NOTIFICATION;
                notif_data[1] = DFU_OPCODE_START_DFU;
                notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
                server_send_data(conn_id, g_dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, DFU_NOTIFY_LENGTH_ARV, GATT_PDU_TYPE_NOTIFICATION);
                return;
            }
        }
        break;

    case DFU_OPCODE_RECEIVE_FW_IMAGE_INFO://0x02
        if (length == DFU_LENGTH_RECEIVE_FW_IMAGE_INFO)
        {
            LE_ARRAY_TO_UINT16(g_dfu_para.signature, p);
            p += 2;
            LE_ARRAY_TO_UINT32(g_dfu_para.cur_offset, p);
            if (g_dfu_para.cur_offset == 0) // || g_dfu_para.cur_offset == DFU_HEADER_SIZE)
            {
                //g_ota_tmp_buf_used_size = 0;
                g_sil_dfu_resend_offset = 0;
            }
            g_ota_tmp_buf_used_size = 0;
            DFU_PRINT_TRACE2("DFU_OPCODE_RECEIVE_FW_IMAGE_INFO: signature = 0x%x, cur_offset = %d",
                             g_dfu_para.signature, g_dfu_para.cur_offset);
        }
        else
        {
            DFU_PRINT_TRACE0("DFU_OPCODE_RECEIVE_FW_IMAGE_INFO: invalid length");
        }
        break;

    case DFU_OPCODE_VALID_FW://0x03

        if (length == DFU_LENGTH_VALID_FW)
        {
            WDG_Config(63, 15, RESET_ALL); //31 - 4s, 63 - 8s
            bool check_result;
            LE_ARRAY_TO_UINT16(g_dfu_para.signature, p);
            DFU_PRINT_TRACE1("DFU_OPCODE_VALID_FW: signature = 0x%x", g_dfu_para.signature);

            check_result = silent_dfu_check_checksum(g_dfu_para.signature);
            DFU_PRINT_INFO1("dfu_act_notify_valid, check_result:%d (1: Success, 0: Fail)", check_result);

            if (check_result)
            {
                notif_data[2] = DFU_ARV_SUCCESS;
            }
            else
            {
                notif_data[2] = DFU_ARV_FAIL_CRC_ERROR;
            }
            notif_data[0] = DFU_OPCODE_NOTIFICATION;
            notif_data[1] = DFU_OPCODE_VALID_FW;
            server_send_data(conn_id, g_dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                             notif_data, DFU_NOTIFY_LENGTH_ARV, GATT_PDU_TYPE_NOTIFICATION);
        }
        else
        {
            DFU_PRINT_TRACE0("DFU_OPCODE_VALID_FW: invalid length");
        }
        break;

    case DFU_OPCODE_ACTIVE_IMAGE_RESET://0x04
        /*notify bootloader to reset and use new image*/
        DFU_PRINT_TRACE0("DFU_OPCODE_ACTIVE_IMAGE_RESET:");
        break;

    case DFU_OPCODE_SYSTEM_RESET://0x05
        {
            DFU_PRINT_ERROR0("DFU_OPCODE_SYSTEM_RESET");

            /*if select not active image even if image transport successful*/
            if (g_dfu_para.signature >= OTA && g_dfu_para.signature < IMAGE_MAX)
            {

                uint32_t temp_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)g_dfu_para.signature);
                T_IMG_CTRL_HEADER_FORMAT *p_temp_header = (T_IMG_CTRL_HEADER_FORMAT *)temp_addr;
                if (p_temp_header && !p_temp_header->ctrl_flag.flag_value.not_ready)
                {
                    flash_erase_locked(FLASH_ERASE_SECTOR, temp_addr & 0xffffff);
                }
            }

            os_delay(2000); //for print log

            WDG_SystemReset(RESET_ALL, DFU_SYSTEM_RESET);
        }
        break;

    case DFU_OPCODE_REPORT_TARGET_INFO://0x06
        if (length == DFU_LENGTH_REPORT_TARGET_INFO)
        {
            LE_ARRAY_TO_UINT16(g_dfu_para.signature, p);
            PROFILE_PRINT_INFO1("g_dfu_para.signature is %x\r\n", g_dfu_para.signature);

            if (g_dfu_para.signature == SIGNATURE_APP_DEFINE)
            {
                flash_read_locked(APP_DEFINE_DATA_ADDR + CAL_OFFSET(T_IMG_HEADER_FORMAT, git_ver), 4,
                                  (uint8_t *)&g_dfu_para.origin_image_version);
                PROFILE_PRINT_INFO1("g_dfu_para.origin_image_version =0x%X", g_dfu_para.origin_image_version);
            }
            else
            {
                dfu_report_target_fw_info(g_dfu_para.signature, &g_dfu_para.origin_image_version,
                                          (uint32_t *)&g_dfu_para.cur_offset);
            }
            g_dfu_para.cur_offset = 0;

