zBlueBird/temperture/temprature-master-based-on-rtl8762c/src/ble/profile/server/dfu_service.c
}


/**
 * @brief silence_dfu_service_handle_packet_req
 *
 * @param length     data reviewed length.
 * @param p_value    data receive point address.
 * @return None
*/
void silence_dfu_service_handle_packet_req(uint16_t length, uint8_t *p_value)
{
    DFU_PRINT_TRACE4("dfu_service_handle_packet_req: length=%d, cur_offset =%d, ota_temp_buf_used_size = %d,image_total_length= %d",
                     length,
                     g_dfu_para.cur_offset,
                     g_ota_tmp_buf_used_size,
                     g_dfu_para.image_total_length
                    );

    if (g_dfu_para.cur_offset + g_ota_tmp_buf_used_size + length > g_dfu_para.image_total_length)
    {
        DFU_PRINT_TRACE4("dfu_service_handle_packet_req: p_dfu->cur_offset=%d, ota_temp_buf_used_size =%d, length= %d, image_total_length = %d ",
                         g_dfu_para.cur_offset,
                         g_ota_tmp_buf_used_size,
                         length,
                         g_dfu_para.image_total_length
                        );
        PROFILE_PRINT_INFO0("dfu_act_reset_and_activate");
    }
    else
    {
        if (g_sil_buf_check_en == true)
        {
            memcpy(p_ota_temp_buffer_head + g_ota_tmp_buf_used_size, p_value, length);
            g_ota_tmp_buf_used_size += length;
        }
        else
        {
            if (length >= 16)
            {
                if (OTP->ota_with_encryption_data)
                {
                    uint16_t offset = 0;
                    do
                    {
                        if ((length - offset) >= 16)
                        {
#if defined ( __ICCARM__   )
#pragma diag_suppress=Pa039
#endif
                            hw_aes_init(OTP->aes_key, NULL, AES_MODE_ECB, OTP->ota_with_encryption_use_aes256);
#if defined ( __ICCARM__   )
#pragma diag_warning=Pa039
#endif
                            hw_aes_decrypt_16byte(p_value + offset, p_value + offset);
                            offset += 16;
                        }
                        else
                        {
                            break;
                        }
                    }
                    while (1);
                }
            }

            memcpy(p_ota_temp_buffer_head + g_ota_tmp_buf_used_size, p_value, length);
            g_ota_tmp_buf_used_size += length;

            if (g_ota_tmp_buf_used_size == 2000 ||
                g_dfu_para.cur_offset + g_ota_tmp_buf_used_size == g_dfu_para.image_total_length)
            {
                unlock_flash_all();
                if (sil_dfu_update(g_dfu_para.signature, g_dfu_para.cur_offset, g_ota_tmp_buf_used_size,
                                   (uint32_t *)p_ota_temp_buffer_head) == 0)
                {
                    lock_flash();
                }
                else
                {
                    /*eflash write fail, we should restart ota procedure.*/
                    lock_flash();
                    silent_dfu_reset(g_dfu_para.signature);
                    dfu_fw_active_reset();
                }
                g_dfu_para.cur_offset += g_ota_tmp_buf_used_size;
                g_ota_tmp_buf_used_size = 0;
            }
        }
    }
}

/**
 * @brief write characteristic data from service.
 *
 * @param ServiceID          ServiceID to be written.
 * @param iAttribIndex       Attribute index of characteristic.
 * @param wLength            length of value to be written.
 * @param pValue             value to be written.
 * @return Profile procedure result
*/
T_APP_RESULT dfu_attr_write_cb(uint8_t conn_id, uint8_t service_id, uint16_t attrib_index,
                               T_WRITE_TYPE write_type,
                               uint16_t length, uint8_t *p_value, P_FUN_WRITE_IND_POST_PROC *p_write_ind_post_proc)
{
    T_APP_RESULT  w_cause = APP_RESULT_SUCCESS;

    if (attrib_index == INDEX_DFU_CONTROL_POINT_CHAR_VALUE)
    {
        silence_dfu_service_handle_control_point_req(conn_id, /*(T_DFU *)p_dfu, */length, p_value);
    }
    else if (attrib_index == INDEX_DFU_PACKET_VALUE)
    {
        silence_dfu_service_handle_packet_req(/*(T_DFU *)p_dfu, */length, p_value);
    }
    else
    {
        PROFILE_PRINT_INFO1("dfuServiceAttribPut Fail: iAttribIndex=%d.", attrib_index);

        return APP_RESULT_ATTR_NOT_FOUND;

    }
    return w_cause;
}

/**
 * @brief update CCCD bits from stack.
 *
 * @param ServiceId          Service ID.
 * @param Index          Attribute index of characteristic data.
 * @param wCCCBits         CCCD bits from stack.
 * @return None
*/
void dfu_cccd_update_cb(uint8_t conn_id, T_SERVER_ID service_id, uint16_t index, uint16_t ccc_bits)
{
    TDFU_CALLBACK_DATA callback_data;
    callback_data.msg_type = SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION;
    callback_data.conn_id = conn_id;
    bool b_handle = true;
    PROFILE_PRINT_INFO2("DfuCccdUpdateCb  Index = %d wCCCDBits %x", index, ccc_bits);
    switch (index)
    {
    case INDEX_DFU_CHAR_CCCD_INDEX:
        {
            if (ccc_bits & GATT_CLIENT_CHAR_CONFIG_NOTIFY)
            {
                // Enable Notification
                callback_data.msg_type = SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION;
                callback_data.msg_data.notification_indification_index = DFU_NOTIFY_ENABLE;
            }
            else
            {
                callback_data.msg_type = SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION;
                callback_data.msg_data.notification_indification_index = DFU_NOTIFY_DISABLE;
            }
            break;
        }
    default:
        {
            b_handle = false;
            break;
        }

    }
    /* Notify Application. */
    if (pfn_dfu_extended_cb && (b_handle == true))
    {
        pfn_dfu_extended_cb(service_id, (void *)&callback_data);
    }

    return;
}

/**
 * @brief OTA ble Service Callbacks.
*/
const T_FUN_GATT_SERVICE_CBS DfuServiceCBs =
{
    NULL,   // Read callback function pointer
    dfu_attr_write_cb,  // Write callback function pointer
    dfu_cccd_update_cb                    // CCCD update callback function pointer
};

/**
 * @brief  add OTA ble service to application.
 *
 * @param  pFunc          pointer of app callback function called by profile.
 * @return service ID auto generated by profile layer.
 * @retval ServiceId
*/
uint8_t dfu_add_service(void *pFunc)
{
    uint8_t service_id;

    if (false == server_add_service(&service_id,
                                    (uint8_t *)silence_dfu_service,
                                    sizeof(silence_dfu_service),
                                    DfuServiceCBs))
    {
        PROFILE_PRINT_ERROR1("DFUService_AddService: ServiceId %d", service_id);
        service_id = 0xff;
        return service_id;
    }
    pfn_dfu_extended_cb = (P_FUN_SERVER_GENERAL_CB)pFunc;

    p_ota_temp_buffer_head = ota_temp_buffer_head;
    return service_id;
}


#endif  // #if SUPPORT_SILENT_OTA


